/*
  String_ui.strings
  iina

  Created by lhc on 3/1/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
// Common

"general.on" = "Be";
"general.off" = "Ki";
"general.login" = "Bejelentkezés";
"general.logout" = "Kijelentkezés";
"general.ok" = "OK";
"general.cancel" = "Mégse";
"general.username" = "Felhasználónév";
"general.password" = "Jelszó";
"general.na" = "N/A";

"input.value_is_empty" = "Az érték nem lehet üres.";
"input.already_exists" = "Az érték már létezik.";

// Guide Window
"guide.highlights" = "Kiemelések";
"guide.basic_settings" = "Alapvető beállítások";
"guide.faq" = "Gyakran Ismételt Kérdések";

// Initial Window
"initial.announcement" = "Ön Az IINA %@ verzióját használja";
"initial.beta.desc" = "Amennyiben végleges verzióra váltana, szüntesse meg a kijelölést a \"béta frissítések\" opciónál a Beállítások > Általános almenüben, és telepítsen stabil verziót a <a href=\"https://iina.io\">hivatalos weboldalunkról</a>.";
"initial.nightly.desc" = "A Nightly verzió nem ajánlott mindennapi használatra. Jelenleg a nightly verzió nem támogatja az automatikus frissítést.. Töltsd le a friss verziót a <a href=\"https://nightly.iina.io\">nightly oldalunkról</a>.";
"initial.debug.desc" = "A hibakeresési verzió általában nincs teljesítményre optimalizálva, ezért nem ajánlott napi használatra. A hibakeresési verziók nem támogatják az automatikus frissítést.";
"initial.bug_report" = "Jelentés a <a href=\"https://github.com/iina/iina/issues\">GitHub-bugok</a> felületen.";

// Inspector Window
"inspector.error" = "Hiba";

// MainWindowController.swift
"main.buffering_indicator" = "Pufferelés…%d%%";
"main.opening_stream" = "Adatfolyam megnyitása…";
"main.seeking_indicator" = "Seeking…";
"osc.precision" = "Pontosság";
"osc.1s" = "1 másodperc";
"osc.100ms" = "100 ezredmásodperc";
"osc.10ms" = "10 ezredmásodperc";
"osc.1ms" = "1 ezredmásodperc";

// QuickSettingViewController.swift
"quicksetting.item_default" = "Alapértelmezett";
"quicksetting.item_none" = "Egyik sem";
"quicksetting.hwdec" = "Hardveres dekódolás";
"quicksetting.deinterlace" = "Váltott soros képszűrő";
"quicksetting.hdr" = "HDR";
"quicksetting.hide" = "Elrejtés";
"quicksetting.reset_speed" = "Sebesség alaphelyzetbe állítása";

// EQ Presets
"eq.preset.flat" = "Lapos";
"eq.preset.acoustic" = "Akusztikus";
"eq.preset.classical" = "Klasszikus";
"eq.preset.dance" = "Dance";
"eq.preset.deep" = "Deep";
"eq.preset.electronic" = "Elektronikus";
"eq.preset.hip_hop" = "Hip-Hop";
"eq.preset.increase_bass" = "Basszus növelése";
"eq.preset.increase_treble" = "Magas növelése";
"eq.preset.increase_vocal" = "Vokál növelése";
"eq.preset.jazz" = "Jazz";
"eq.preset.latin" = "Latin";
"eq.preset.loundness" = "Hangerő";
"eq.preset.lounge" = "Lounge";
"eq.preset.piano" = "Zongora";
"eq.preset.pop" = "Pop";
"eq.preset.rnb" = "R&B";
"eq.preset.reduce_bass" = "Basszus csökkentése";
"eq.preset.reduce_treble" = "Magas csökkentése";
"eq.preset.rock" = "Rock";
"eq.preset.small_speaker" = "Kicsi hangszóró";
"eq.preset.spoken_word" = "Beszélt szó";

"alert.eq.new_profile.title" = "Új EQ profil";
"alert.eq.new_profile.message" = "Kérjük, adjon meg egy profilnevet.";
"alert.eq.rename.title" = "Jelenlegi profil átnevezése";
"alert.eq.rename.message" = "Kérjük, adjon meg egy új profilnevet.";

// OSDMessage.swift
"osd.pause" = "Szünet";
"osd.resume" = "Folytatás";
"osd.volume" = "Hangerő: %@";
"osd.speed" = "Sebesség: %@x";
"osd.aspect" = "Képarány: %@";
"osd.crop" = "Vágás: %@";
"osd.rotate" = "Elforgatás: %i°";
"osd.deinterlace" = "Váltottsoros képszűrő: %@";
"osd.hwdec" = "Hardveres dekódolás: %@";
"osd.audio_delay.nodelay" = "Hangkésleltetés: Nincs késleltetés";
"osd.audio_delay.later" = "Hangkésleltetés: %@mp-vel később";
"osd.audio_delay.earlier" = "Hangkésleltetés: %@mp-vel hamarabb";
"osd.sub_delay.nodelay" = "Felirat késleltetés: Nincs késleltetés";
"osd.sub_delay.later" = "Felirat késleltetés: %@mp-vel később";
"osd.sub_delay.earlier" = "Felirat késleltetés: %@mp-vel hamarabb";
"osd.subtitle_pos" = "Felirat pozíciója: %@";
"osd.sub_hidden" = "Feliratok elrejtve";
"osd.sub_visible" = "Feliratok megjelenítve";
"osd.sub_second_delay.nodelay" = "Másodlagos felirat késleltetés: Nincs késleltetés";
"osd.sub_second_delay.later" = "Másodlagos felirat késleltetés: %@mp-vel később";
"osd.sub_second_delay.earlier" = "Másodlagos felirat késleltetés: %@mp-vel előbb";
"osd.sub_second_hidden" = "Másodlagos feliratok elrejtve";
"osd.sub_second_pos" = "Másodlagos felirat pozíció: %@";
"osd.sub_second_visible" = "Másodlagos feliratok megjelenítve";
"osd.mute" = "Némítás";
"osd.unmute" = "Némítás feloldása";
"osd.screenshot" = "Képernyőkép rögzítve";
"osd.abloop.a" = "AB-Ciklus: A";
"osd.abloop.b" = "AB-Ciklus: B";
"osd.abloop.clear" = "AB-Ciklus: Tiszta";
"osd.stop" = "Leállítás";
"osd.chapter" = "Fejezet: %@";
"osd.subtitle_scale" = "Felirat méret: %@x";
"osd.add_to_playlist" = "%i fájl hozzáadva a lejátszási listához";
"osd.clear_playlist" = "Lejátszási lista ürítése";
"osd.video_eq.contrast" = "Kontraszt: %i";
"osd.video_eq.gamma" = "Gamma: %i";
"osd.video_eq.hue" = "Színárnyalat: %i";
"osd.video_eq.saturation" = "Telítettség: %i";
"osd.video_eq.brightness" = "Fényerő: %i";
"osd.find_online_sub" = "Online feliratok keresése…";
"osd.find_online_sub.source" = "forrás";
"osd.sub_not_found" = "Nem található felirat";
"osd.sub_found" = "%d felirat található.";
"osd.sub_downloading" = "%d felirat letöltése";
"osd.sub_downloaded" = "Felirat letöltve";
"osd.sub_saved" = "Felirat mentve";
"osd.network_error" = "Hálózati hiba";
"osd.file_error" = "Hiba a fájl olvasásakor";
"osd.cannot_login" = "Sikertelen belépés";
"osd.canceled" = "Megszakítva";
"osd.cannot_connect" = "Nem tud csatlakozni";
"osd.timed_out" = "Időtúllépés";
"osd.filter_added" = "Szűrő hozzáadása: %@";
"osd.filter_removed" = "Szűrő eltávolítása";
"osd.file_loop" = "Egyetlen fájl ismétlése";
"osd.playlist_loop" = "Ismétlődő lejátszási lista";
"osd.no_loop" = "Ismétlés kikapcsolása";

"preference.title" = "Beállítások";
"preference.general" = "Általános";
"preference.ui" = "Felhasználói felület";
"preference.video_audio" = "Video/Audio";
"preference.subtitle" = "Felirat";
"preference.network" = "Hálózat";
"preference.control" = "Vezérlés";
"preference.keybindings" = "Gyorsgombok";
"preference.advanced" = "Haladó";
"preference.plugins" = "Pluginok";
"preference.utilities" = "Eszközök";
"preference.scripts" = "Szkriptek";
"preference.not_logged_in" = "Nem vagy bejelentkezve";
"preference.logged_in_as" = "Bejelentkezve, mint %@";
"preference.system_media_control" = "Rendszer média vezérlők használata";

"preference.key_binding_hint_1" = "A billentyűkiosztás módosításához a jelenlegi fájlban, először nyomja meg a \"Duplikáció...\" gombot egy másolat létrehozásához.";
"preference.key_binding_hint_2" = "Kattintson duplán egy sorra a jobb oldalon a megfelelő billentyű kiosztás szerkesztéséhez.";

"preference.enable_adv_settings" = "Haladó beállítások engedélyezése";

"preference.sub_override_level.no" = "nem";
"preference.sub_override_level.force" = "kényszerített";
"preference.sub_override_level.scale" = "méretezés";
"preference.sub_override_level.strip" = "csík";
"preference.sub_override_level.yes" = "igen";

"preference.sub_override_level.descriptive_text.no" = "A feliratokat a feliratozási szkriptek által megadott módon, felülírások nélkül adja vissza.";
"preference.sub_override_level.descriptive_text.force" = "Minden feliratstílus alkalmazása.";
"preference.sub_override_level.descriptive_text.scale" = "Az ebben a szakaszban található stílusbeállítások mellett alkalmazza a méretezés beállítását is.";
"preference.sub_override_level.descriptive_text.strip" = "Alaposan távolítson el minden ASS taget és stílust a feliratból.";
"preference.sub_override_level.descriptive_text.yes" = "Alkalmazza az összes stílusbeállítást ebben a szakaszban.";

"preference.ytdl_plugin_not_installed" = "Telepítse az Online Media bővítményt a \"Bővítmények > Telepítés a GitHub-ról\" menüpont segítségével, hogy élvezhesse a fejlett képességeket, mint a videó letöltése és az automatikus yt-dlp frissítések.";
"preference.ytdl_plugin_installed" = "A beépített youtube-dl támogatás nincs engedélyezve, mert az Online Media bővítmény telepítve van.";

"menu.volume" = "Hangerő: %@";
"menu.volume_muted" = "Hangerő: %@ (Némítva)";
"menu.audio_delay" = "Hangkésleltetés: %@mp-vel később";
"menu.sub_delay" = "Felirat késleltetés: %@mp-vel később";
"menu.sub_hide" = "Feliratok elrejtése";
"menu.sub_show" = "Feliratok megjelenítése";
"menu.sub_second_hide" = "Másodlagos feliratok elrejtése";
"menu.sub_second_show" = "Másodlagos feliratok megjelenítése";
"menu.fullscreen" = "Váltás teljes képernyőre";
"menu.exit_fullscreen" = "Kilépés a teljes képernyős módból";
"menu.pip" = "Kép a képben";
"menu.exit_pip" = "Kilépés kép a képben módból";
"menu.mini_player" = "Belépés \"zene\" módba";
"menu.exit_mini_player" = "Kilépés zene módból";
"menu.pause" = "Pause (Megállít)";
"menu.resume" = "Folytatás";
"menu.speed" = "Sebesség: %@x";
"menu.chapters" = "Fejezet Panel Megjelenítése";
"menu.hide_chapters" = "Rejtsd a fejezetek panelt";
"menu.playlist" = "Lejátszási lista megjelenítése";
"menu.hide_playlist" = "Rejtsd a lejátszólistát";
"menu.video" = "Mutasd a videó panelt";
"menu.hide_video" = "Rejtsd a videó panelt";
"menu.audio" = "Mutasd a hang panelt";
"menu.hide_audio" = "Rejtsd a hang panelt";
"menu.subtitles" = "Mutasd a feliratok panelt";
"menu.hide_subtitles" = "Rejtsd a feliratok panelt";

"menu.seek_forward" = "Előre ugrás %@ másodpercet";
"menu.seek_backward" = "Hátra ugrás %@ másodpercet";
"menu.speed_up" = "Gyorsítás ennyivel: %@x";
"menu.speed_down" = "Lassítás ennyivel: %@x";
"menu.volume_up" = "Hangerő: %@";
"menu.volume_down" = "Hangerő: %@";
"menu.audio_delay_up" = "Hangkésleltetés + %@ másodperccel";
"menu.audio_delay_down" = "Hangkésleltetés: %@mp-el később";
"menu.sub_delay_up" = "Felirat késleltetés + %@ másodperccel";
"menu.sub_delay_down" = "Felirat késleltetés - %@ másodperccel";

"menu.crop_custom" = "Egyéni…";
"menu.find_online_sub" = "Online feliratok keresése innen: %@";

"menu.manage_plugins" = "Bővítmények kezelése…";
"menu.developer_tool" = "Fejlesztőeszköz";
"menu.more_plugin" = "Továbbiak…";
"menu.conflicting_shortcuts" = "Billentyűparancs konfliktusok…";
"menu.reload_plugins" = "Minden bővítmény újratöltése";
"menu.show_plugins_panel" = "Bővítmény panel megjelenítése";
"menu.hide_plugins_panel" = "Bővítmény panel elrejtése";

"track.audio" = "Hang";
"track.none" = "<None>";
"track.sub" = "Felirat";
"track.video" = "Videó";

"subtrack.no_loaded" = "Nincs felirat betöltve";
"subtrack.no_external" = "Nem található külsõ forrásból felirat";

// Alerts
"alert.beta_channel.title" = "Frissítések bekapcsolása Beta verzióra";

"alert.title_error" = "Hiba";
"alert.title_warning" = "Figyelmeztetés";
"alert.title_info" = "Információ";

"alert.fatal_error" = "Kritikus hiba: %@\nAz alkalmazás bezárul.";
"alert.mpv_error" = "Hiba történt %@ (%@) az opció %@ beállítása közben.";

"alert.unsupported_audio" = "Nem támogatott külsõ hang fájl.";
"alert.unsupported_video" = "Unsupported external video file.";
"alert.unsupported_sub" = "Nem támogatott külsõ felirat.";
"alert.unsupported_url" = "Nem támogatott URL.";
"alert.wrong_url_format" = "Hibás URL formátum.";

"alert.error_open" = "Fájl vagy közvetítés megnyitás sikertelen!";
"alert.error_finding_file" = "A fájl %@ nem található!";
"alert.error_loading_script" = "A szkript %@ nem tölthetõ be!";
"alert.error_saving_file" = "Hiba történt mentéskor %@: %@";
"alert.error_deleting_file" = "Nem sikerült törölni a fájlt.";

"alert.target_peak.bad_value" = "A \"%@\" érték érvénytelen.\nAdjon meg egy 10 és 10000 közötti értéket, vagy 0-át.";

"alert.config.new.title" = "Új beviteli konfiguráció";
"alert.config.new.message" = "Kérlek adj nevet az új konfigurációnak.";
"alert.config.duplicate.title" = "Konfiguráció duplikálása";
"alert.config.duplicate.message" = "Kérlek adj nevet az új duplikált konfigurációnak.";
"alert.config.file_existing.title" = "A fájl már létezik";
"alert.config.file_existing.message" = "Egy azonos fájlnevű konfigurációs fájl már létezik. Válassza az OK lehetőséget a fájl megjelenítéséhez a Finderben.";
"alert.config.cannot_create" = "Konfigurációs fájl nem hozható létre!\n%@";
"alert.config.cannot_write" = "Konfigurációs fájl nem irható!";
"alert.config.rename.title" = "Bemeneti konfiguráció átnevezése";
"alert.config.rename.message" = "Adja meg a konfiguráció új nevét.";

"alert.filter.incorrect" = "Hiba történt a szűrők beállításakor. Kérjük, ellenőrizd le a paraméter formátumát.";
"alert.add_filter.title" = "Új filter";
"alert.add_filter.message" = "Adjon meg egy szűrő karakterláncot az mpv vf vagy af parancsának formátumában.";

"alert.keybinding_config.error" = "Hiba a \"%@\" billentyűkombinációs konfigurációs fájl elemzésekor! Visszatérés az IINA alapértelmezett billentyűkombinációjához. Kérjük, ellenőrizze a konfigurációt.";

"alert.extra_option.cannot_read" = "A felhasználó által meghatározott extra mpv beállítások nem olvashatók.";
"alert.extra_option.empty" = "A kulcs vagy az érték nem lehet üres!";
"alert.extra_option.error" = "Hiba a beállítás --%@=%@ %d visszatérési értékkel. Kérjük, ellenőrizze az extra beállításokat a Beállítások > Speciális oldalon.";
"alert.extra_option.config_folder" = "Hiba a konfigurációs könyvtár beállításánál \"%@\".";

"alert.playlist.error_deleting" = "Hiba törlés közben %@";

"alert.screenshot.error_taking" = "Nem lehet képernyőképet készíteni!";

"alert.sub.no_selected" = "Kérjük, először válassz ki egy letöltött feliratot.";
"alert.sub_lang_not_set" = "Kérjük, az OpenSubtitles használata előtt állítsd be a kívánt feliratnyelvet a beállításokban. Ezúttal az angol (eng) nyelvet használjuk.";
"alert.sub.cannot_save_passwd" = "Nem lehet elmenteni a jelszavat a Kulcskarikában: %@";
"alert.sub.cannot_login" = "Nem tudsz bejelentkezni. Kérjük, ellenőrizd a felhasználónevedet, jelszavadat és a hálózat állapotát.\n\n%@";
"alert.sub.save_downloaded.title" = "Letöltött felirat mentése";

"alert.set_default.title" = "IINA beállítása alapértelmezettként";
"alert.set_default.message" = "Az IINA be lesz állítva mint alapértelmezett lejátszó az összes támogatott fájltípushoz.";
"alert.set_default.success" = "Befejezve %d sikeres és %d sikertelen.";

"alert.add_watch.title" = "Nézési tulajdonság hozzáadása";
"alert.add_watch.message" = "Adj meg egy érvényes mpv tulajdonságnevet.";

"alert.jump_to.title" = "Ugrás ide";
"alert.jump_to.message" = "Kérlek adj meg időpontot ahova ugrani szeretnél. Példa: 20:35";

"alert.opensub.login.title" = "OpenSubtitles bejelentkezés";
"alert.opensub.login.message" = "Kérlek, add meg a felhasználóneved és jelszavad";

"alert.open_url.title" = "URL megnyitása";
"alert.open_url.message" = "Kérlek add meg az URL-t:";
"alert.choose_media_file.title" = "Média fájlok kiválasztása";

"alert.add_url.title" = "URL hozzáadása";
"alert.add_url.message" = "Kérlek add meg az URL-t:";

"alert.delete_history.title" = "Lejátszási elõzmények törlése";
"alert.delete_history.message" = "Biztosan törlöd a kijelölt elemeket?";

"alert.filter_hwdec.message" = "Egy videószűrő alkalmazására készülsz. Előfordulhat azonban, hogy jelenlegi hardveres dekódered nem támogatja megfelelően a videoszűrőket. Letilthatod a hardveres dekódolást, vagy átválthatsz Auto(Másolás) módra, ami kétszer annyi memóriát fogyaszt.\nElőfordulhat, hogy meg kell ismételned az előző műveletet (például a kivágás beállítását), hogy működjön.";
"alert.filter_hwdec.abort" = "Megszakítás";
"alert.filter_hwdec.turn_off" = "Hardver dekódolás kikapcsolása";
"alert.filter_hwdec.use_copy" = "Váltás automatikusra (másolás)";

"alert.clear_cache.title" = "Indexkép gyorsító tár törlése";
"alert.clear_cache.message" = "Biztosan törli az indexkép gyorsítót árat?";

"alert.clear_history.title" = "Lejátszási elõzmények törlése";
"alert.clear_history.message" = "Biztosan akarod törölni az összes lejátszási előzményeket?";

"alert.clear_watch_later.title" = "Mentett lejátszási folyamat törlése";
"alert.clear_watch_later.message" = "Biztos vagy benne, hogy törlöd az összes mentett lejátszási folyamatot (\"megtekintés később\" adatok)?";

"alert.restore_alerts.title" = "Az elnyomott figyelmeztetések visszaállítása";
"alert.restore_alerts.message" = "Biztosan vissza szeretné állítani az elnyomott figyelmeztetéseket?";

"alert.nothing_to_open" = "Nincs mit megnyitni.";

"alert.no_video_track" = "Nincs videó file.";

"alert.duplicate_config" = "Az alapértelmezett konfigurációk közvetlenül nem szerkeszthetők. Szerkesztés előtt kettőzz meg egyet.";

"alert.assrt_register" = "A korlátozott API-kvóta miatt erősen ajánlott saját API-token használata. Az alapértelmezett token csak demóhasználatra szolgál, és hálózati hibába ütközhet.";
"alert.assrt_register.register" = "Regisztráció most";
"alert.assrt_register.try" = "Próbálja ki először";
"alert.assrt_token_prompt.title" = "Adja meg az API Token-jét";
"alert.assrt_token_prompt.message" = "Kérlek regisztrálj a megnyitott weboldalon. Szerezd meg a tokened a felhasználó főoldalán és írd be ide:";
"alert.assrt_token_invalid" = "Az Assrt API tokened helytelen.";

"alert.plugin_uninstall.title" = "Biztosan eltávolítja a következőt: %@?";
"alert.plugin_uninstall.message" = "A bővítmény törlődik a lemezről.";
"alert.plugin_reinstall.title" = "%@ bővítmény már létezik";
"alert.plugin_reinstall.message" = "Szeretné újratelepítené a bővítményt?";
"alert.duplicated_plugin_id" = "Duplikált bővítmény-azonosítók észlelése. Két vagy több bővítmény azonos \"%@\" azonosítóval rendelkezik. Ez rendellenes viselkedést okozhat. Kérjük, keresse meg őket a Beállítások - Pluginok menüpontban, és jelentse a szerzőjüknek. Ha egy bővítményt helyileg telepítettek, manuálisan is megváltoztathatja az azonosítóját a bővítmény Info.json fájljában.";
"alert.plugin_no_update" = "Nem található frissítés.";
"alert.plugin_update_found.title" = "Frissítés található a következőhöz: %@";
"alert.plugin_update_found.message" = "A legújabb verzió a(z) %@. Neked a(z) %@ van telepítve. Szeretne frissíteni?";
"alert.plugin_permission" = "Ehhez a bővítményhez a következő engedélyekre van szükség. Kérjük, tekintse át őket a folytatás előtt.";
"alert.plugin_permission_added" = "Ez a frissítés további engedélyeket igényel. Kérjük, tekintse át őket a folytatás előtt.";

"playlist.total_length" = "%@ összesen";
"playlist.total_length_with_selected" = "%@/%@ kiválasztva";
"playlist.sorting.header" = "Sorting";
"playlist.sorting.filename_ascending" = "Filename Ascending";
"playlist.sorting.filename_descending" = "Filename Descending";
"playlist.sorting.path_ascending" = "File Path Ascending";
"playlist.sorting.path_descending" = "File Path Descending";
"pl_menu.title_multi" = "%d elem";
"pl_menu.play_next" = "Lejátszás következőként";
"pl_menu.play_in_new_window" = "Lejátszás új ablakban";
"pl_menu.remove" = "Eltávolítás";
"pl_menu.remove_multi" = "Kijelölt elemek eltávolítása";
"pl_menu.delete" = "Áthelyezés a kukába";
"pl_menu.delete_multi" = "A kiválasztott fájlok áthelyezése a kukába";
"pl_menu.delete_after_play" = "Áthelyezés a kukába lejátszás után";
"pl_menu.delete_after_play_multi" = "Kiválasztott fájlok áthelyezése a kukába lejátszás után";
"pl_menu.show_in_finder" = "Megjelenítés a Finder-ben";
"pl_menu.add_file" = "Fájl hozzáadása…";
"pl_menu.add_url" = "URL hozzáadása…";
"pl_menu.clear_playlist" = "Lejátszási lista ürítése";
"pl_menu.matched_sub" = "Megfelelő %d Felirat(ok)";
"pl_menu.add_sub" = "Felirat hozzáadása…";
"pl_menu.wrong_sub" = "Rossz felirat!";
"pl_menu.browser" = "Megnyitás böngészőben";
"pl_menu.copy_url" = "Az URL másolása";
"pl_menu.copy_url_multi" = "Linkek másolása";

"keymapping.title" = "Billentyűkiosztás";
"keymapping.message" = "Nyomj egy gombot a felvételhez.";

"filter.video_filters" = "Videószűrők";
"filter.audio_filters" = "Hangszűrők";

"hwdec.no" = "Hardver dekódolás kikapcsolása.";
"hwdec.auto" = "Hardver dekódolás bekapcsolása. A legtöbb videószűrő azonban nem fog megfelelően működni.";
"hwdec.auto-copy" = "Hardver dekódolás bekapcsolása. Dupla memóriát fogyaszt, de videoszűrőkkel működik.";

"gaplessAudio.no" = "Playback of consecutive audio files may result in silence or disruption at the point of file change.";
"gaplessAudio.weak" = "If the audio format the decoder output changes, the audio device is closed and reopened, disrupting gapless playback.";
"gaplessAudio.yes" = "The audio device is opened using parameters chosen for the first file played and is then kept open for gapless playback. Following files may be resampled.";

"subencoding.auto" = "Automatikus felismerés";

"osc_toolbar.settings" = "Gyorsbeállítások";
"osc_toolbar.playlist" = "Lejátszás listák és fejezetek";
"osc_toolbar.pip" = "Kép a képben";
"osc_toolbar.full_screen" = "Váltás teljes képernyõre";
"osc_toolbar.music_mode" = "Belépés \"zene\" módba";
"osc_toolbar.sub_track" = "Válassz felirat sávot";
"osc_toolbar.screenshot" = "Képernyőmentés készítése";
"osc_toolbar.plugins" = "Bővítmény panel megjelenítése";

"mini_player.album_art" = "Album borító váltás";
"mini_player.loop" = "Ismétlés";
"mini_player.shuffle" = "Véletlenszerű";
"mini_player.remove" = "Eltávolítás a lejátszási listából";
"mini_player.add" = "Hozzáadás a lejátszási listához";
"mini_player.delete" = "Minden szám törlése a lejátszási listáról";
"mini_player.volume" = "Hangerő";
"mini_player.close" = "Zene mód bezárása";
"mini_player.back" = "Vissza videó módba";
"mini_player.sort" = "Sort the playlist";

// Touch bar

"touchbar.ahead_15" = "15 másodperc előre";
"touchbar.ahead_30" = "30 másodperc előre";
"touchbar.back_15" = "15 másodperc hátra";
"touchbar.back_30" = "30 másodperc hátra";
"touchbar.next_video" = "Következő videó";
"touchbar.prev_video" = "Előző videó";
"touchbar.increase_volume" = "Hangerő +";
"touchbar.decrease_volume" = "Hangerő -";
"touchbar.rewind" = "Visszapörgetés";
"touchbar.fast_forward" = "Gyors előretekerés";
"touchbar.play_pause" = "Lejátszás / Megállítás";
"touchbar.seek" = "Ugrás";
"touchbar.time" = "Idő pozició";
"touchbar.remainingTimeOrTotalDuration" = "Hátralévõ idõ / Teljes idõ";
"touchbar.toggle_pip" = "Kép a képben";

// Plugin permissions

"permissions.network-request.name" = "Hálózati kérés";
"permissions.network-request.desc" = "Ez a bővítvény a következő webhelyekre kérhet vagy tölthet fel adatokat:";
"permissions.network-request.any_site" = "Bármely webhely";
"permissions.show-osd.name" = "OSD megjelenítése";
"permissions.show-osd.desc" = "Ez a bővítvény képes megjeleníteni az OSD-n (képernyőn megjelenő kijelző) üzeneteket.";
"permissions.show-alert.name" = "Figyelmeztetések megjelenítése";
"permissions.show-alert.desc" = "Ez a bővítmény képes felugró figyelmeztetéseket megjeleníteni.";
"permissions.video-overlay.name" = "Overlay hozzáadása videókhoz";
"permissions.video-overlay.desc" = "Ez a bővítmény képes további tartalmakat megjeleníteni a videó tetején.";
"permissions.file-system.name" = "Hozzáférés a fájlrendszerhez";
"permissions.file-system.desc" = "Ez a bővítmény képes olvasni vagy írni a lemezen lévő fájlokat, beleértve az érzékeny információkat is. Más programokat vagy alkalmazásokat is meghívhat, amelyek kárt tehetnek a számítógépében. Ezért mindenképpen ellenőrizze a forrást.";

"plugin.install" = "Telepítés";
"plugin.installed" = "Telepítve";
"plugin.not_installed" = "Nincs telepítve";
"plugin.local" = "Helyben telepítve";
"alert.plugin.install_error" = "Hiba lépett fel a telepítés során: %@";
"alert.invalid_url" = "Érvénytelen link.";
"plugin.install_error.invalid_url" = "Érvénytelen link.";
"plugin.install_error.file_not_found" = "A csomagfájl nem található.";
"plugin.install_error.cannot_download" = "Nem sikerült letölteni a plugint.\n\nKimenet:%@\n";
"plugin.install_error.cannot_unpackage" = "Nem sikerült kicsomagolni a plugint.\n\nKimenet:%@\n";
"plugin.install_error.cannot_load" = "Az IINA nem tudja betölteni ezt a bővítményt. Lehet, hogy rossz formátumban van.";
"plugin.check_for_updates" = "Frissítések keresése";
"plugin.updating" = "Frissítés letöltése…";
